# ЛАБОРАТОРНАЯ РАБОТА № 8  
## C++: ДАННЫЕ. УКАЗАТЕЛИ И МАССИВЫ

---

## I. ТЕОРИЯ И ПОЯСНЕНИЯ

### I.1. Этапы подготовки переменных и функций к использованию в программе

Основными элементами программы на языке C являются переменные и функции. Любой из этих элементов должен быть подготовлен к использованию.

В целом эта подготовка выполняется в **3 этапа**:
- объявление;
- определение;
- инициализация.

**Объявление** – задание имени и типа переменной или функции.  
**Определение** – создание переменной (выделение памяти) или задание исходного кода функции.  
**Инициализация** – присвоение начального значения переменной.

Для переменных объявление и определение обычно выполняются одновременно.

Глобальная переменная, т.е. переменная, объявленная вне функций, получает по умолчанию нулевое начальное значение; для локальных переменных начальное значение не определено.

Если заранее известно, каким должно быть начальное значение, то инициализация проводится вместе с определением переменной, например:

```cpp
int x = 10;
double y = 3.14;
```

**Объявление функции** – это задание её прототипа, т.е. имени функции, типов параметров и типа возвращаемого значения (имена параметров можно не задавать).

Пример:
```cpp
int sum(int, int);
```

**Определение функции** включает полный заголовок с именами параметров и исходный код (тело функции):

```cpp
int sum(int a, int b)
{
    return a + b;
}
```

Если функция не была объявлена ранее в файле программы, то определение включает и объявление функции.

Присваивать переменной новое значение можно только после её объявления и определения.  
Использовать переменную в вычислениях можно только после присвоения значения.  
Вызывать функцию можно только после её объявления или определения.

---

### I.2. Область видимости данных

Объявленным именем можно пользоваться только в определённой части программы.

Областью видимости переменной является блок, в котором она объявлена, от места объявления до конца блока.

- Глобальные переменные объявляются вне функций.
- Если имена глобальной и локальной переменной совпадают, используется локальная.
- Областью видимости формальных параметров функции является тело функции.

---

### I.3. Ссылки в C++

Ссылка (reference) – это альтернативное имя для объекта.

```cpp
int x = 5;
int &ref = x;
```

Ссылка должна быть инициализирована сразу.

Изменение значения по ссылке изменяет исходный объект:

```cpp
ref = 20;
cout << x << endl; // 20
```

Пример передачи параметров:

```cpp
void do(int n){ n = 6; }
int main(){ int a = 0; do(a); cout << a; } // 0
```

```cpp
void do(int &n){ n = 6; }
int main(){ int a = 0; do(a); cout << a; } // 6
```

---

### I.4. Указатели в C++

Указатель – это переменная, значением которой является адрес области памяти.

```cpp
int *p;
double *q;
```

Операторы работы с памятью:

```cpp
int *p = new int;
delete p;
```

#### Взятие адреса
```cpp
int z = 8;
int *w = &z;
```

#### Разыменование
```cpp
*w = 17;
cout << *w;
```

> **ВАЖНО**  
> Оператор `*` при объявлении — указатель,  
> в остальных случаях — операция **разыменования**.

#### Адресация полей структуры
```cpp
struct rec { int a; float t; };
rec *ps = new rec;
ps->a = 6;
ps->t = 3.14;
```

#### Арифметика указателей
```cpp
int *h;
h++;
```

---

### I.5. Массивы в C++

Имя массива — указатель на начало массива.  
Элементы нумеруются с 0.

```cpp
#define N 10
int s[N];
```

Имена статических массивов — константы-указатели.

Динамический массив:
```cpp
int *d;
d = new int[100];
delete[] d;
```

Обращение к элементам:
```cpp
s[i];
*(s + i);
```

---

## II. ЗАДАНИЯ

### II.1. УПРАЖНЕНИЕ 1
Объясните использование типов и переменных в программе.  
Определите значения `n` и `m` без компиляции.

---

### II.2. УПРАЖНЕНИЕ 2
1. Найдите ошибки в программе и объясните её назначение.  
2. Напишите функцию с аргументами:
   - по ссылке;
   - через указатель.

---

### II.3. УПРАЖНЕНИЕ 3
1. Заполните массив квадратами индексов четырьмя способами:
   - статический, индексный;
   - статический, через указатель;
   - динамический, индексный;
   - динамический, через указатель.
2. Объедините два упорядоченных массива без сортировки.

---

### II.4. УПРАЖНЕНИЕ 4
Создайте двусвязный самоадресуемый список из 10 элементов и выведите его.
