# ЛАБОРАТОРНАЯ РАБОТА № 7  
## СОЗДАНИЕ КОНСОЛЬНОГО ПРИЛОЖЕНИЯ НА C++  
### В MS VISUAL STUDIO

---

## I. ТЕОРИЯ И ПОЯСНЕНИЯ

### I.1. Загрузка Visual Studio 2019 Community

Находим в поиске среду разработки **Visual Studio 2019 Community** и устанавливаем её.  
При установке и загрузке может понадобиться **Microsoft account**.

Для разработки будем использовать версию с **англоязычным интерфейсом**.  
Если после установки оказался русскоязычный интерфейс, то выполним дополнительные настройки.

Загружаем приложение **Visual Studio Installer**.  
Выбираем действие **Изменить**.  
Далее пункт **Языковые пакеты** — отмечаем **Английский** — кнопка **Изменить**.
---

### I.2. Шаблон для консольного приложения

Директива препроцессора `#include` используется для подключения к проекту содержимого
заголовочных файлов (`.h`), содержащих интерфейсную информацию о стандартных функциях
и константах.

Примеры:

```cpp
#include <iostream>
#include <math.h>
#include <stdlib.h>
```

- В **двойных кавычках** (`"stdafx.h"`) — если файл находится в проекте;
- В **угловых скобках** (`<math.h>`) — если это стандартный заголовочный файл C++.

В соответствии со стандартом C++ имена стандартных файлов можно указывать **без расширения**:
```cpp
#include <iostream>
```

После директив `#include` указывается пространство имён:

```cpp
using namespace std;
```

Программа на языке C++ представляет собой набор функций.  
Одна из функций определяет точку входа — функция `main`.

Простейший шаблон программы:

```cpp
#include <iostream>
using namespace std;

int main()
{
    cout << "Hello World!";
    return 0;
}
```

---

### I.3. Отладка программы

Написанную программу рекомендуется сначала компилировать в режиме **Debug**.  
Система выполняет построение проекта (**Build**).

Сообщения об ошибках выводятся в окно **Output**.

Для отладки используются:
- точки останова;
- пошаговое выполнение:
  - **F10** — без захода в функции;
  - **F11** — с заходом в функции;
  - **Shift + F5** — выход из режима отладки.

Пример программы для отладки:

```cpp
#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    int a, b;
    cout << "Два целых числа ";
    cin >> a >> b;
    cout << a << " + " << b << " = " << a + b << endl;
}
```

---

### I.4. Режим Release

Полностью отлаженную программу необходимо запустить в режиме **Release**.

В исполняемом файле отсутствует отладочная информация, за счёт чего:
- уменьшается размер файла;
- повышается производительность.

---

## II. ЗАДАНИЯ

Все задания следует реализовать **в одном консольном проекте** системы MS Visual Studio.

**Рекомендация:**  
Для корректного использования кириллицы добавьте в код:
```cpp
setlocale(LC_ALL, "Russian");
```

---

### II.1. ВЫЧИСЛЕНИЕ ЗНАЧЕНИЙ ФУНКЦИИ

Напишите программу вычисления значений функции:

```
f(x) = sin(x) / x
```

в **десяти равноотстоящих точках** интервала **(0, 4]**.

**Входные данные:**  
Начальная точка интервала возможных значений аргумента `x`.

**Выходные данные:**  
Результаты вычислений выводятся на экран **в удобном для чтения виде**  
**без использования параметров форматирования**.

---

### II.2. ЧИСЛА ФИБОНАЧЧИ

Напишите программу вычисления:
- `S` — суммы `N` первых чисел Фибоначчи.

Вычисления проводить до тех пор, пока сумма не превысит заданное большое число `MAX`.

**Ограничение:**  
❌ Реализация с рекурсией **НЕ допускается**.

**Входные данные:**  
Значение `MAX`.

**Результаты:**  
Значения `N` и `S`.

---

### II.3. КРЕДИТНЫЕ ПЛАТЕЖИ

Напишите программу, выводящую таблицу **ежемесячных платежей по кредиту**.

**Исходные данные:**
- сумма кредита;
- срок в месяцах;
- процентная ставка (годовых).

Предполагается, что:
- кредит выплачивается **ежемесячно равными долями**;
- проценты начисляются **ежемесячно на величину долга**.

**Пример входных данных:**
```
Сумма (руб.)  -> 150000
Срок (мес.)   -> 12
Процентная ставка (годовых) -> 14
```

**Результаты вычислений оформляются в виде таблицы:**

```
№   Долг        Процент    Платеж
1   150000.00   1750.00    14250.00
2   137500.00   1604.17    14104.17
3   125000.00   1458.33    13958.33
4   112500.00   1312.50    13812.50
5   100000.00   1166.67    13666.67
6   87500.00    1020.83    13520.83
7   75000.00    875.00     13375.00
8   62500.00    729.17     13229.17
9   50000.00    583.33     13083.33
10  37500.00    437.50     12937.50
11  25000.00    291.67     12791.67
12  12500.00    145.83     12645.83

Всего процентов: 11375.00
```

**Обязательно:**  
Для ввода и вывода использовать функции:
```c
scanf()
printf()
```
